mesh/snappyHexMesh/0.org/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "./system/parameters"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $pInf;

boundaryField
{
    AIN
    {
        type            zeroGradient;
    }
    AOUT
    {
        type            totalPressure;
        p0              $internalField;
        U               U;
        phi             phi;
        rho             rho;
        psi             none;
        gamma           0;
        value           $internalField;
    }
    WALL
    {
        type            zeroGradient;
    }
    VOUT
    {
        type            zeroGradient;
    }

}


// ************************************************************************* //
