mesh/snappyHexMesh/Allrun
#!/bin/sh

cd ${0%/*} || exit 1

. $WM_PROJECT_DIR/bin/tools/RunFunctions

./Allmesh

runApplication decomposePar
runParallel $(getApplication)
