mesh/snappyHexMesh/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

AIN.stl
{
    extractionMethod    extractFromSurface;

    extractFromSurfaceCoeffs
    {
        // Mark edges whose adjacent surface normals are at an angle less
        // than includedAngle as features
        // - 0  : selects no edges
        // - 180: selects all edges
        includedAngle   120;
    }

    // Write options

        // Write features to obj format for postprocessing
        writeObj                no;
}

AOUT.stl
{
    extractionMethod    extractFromSurface;
    extractFromSurfaceCoeffs
    {
        includedAngle   120;
    }
    writeObj                no;
}

VOUT.stl
{
    extractionMethod    extractFromSurface;
    extractFromSurfaceCoeffs
    {
         includedAngle   120;
    }
    writeObj                no;
}

WALL.stl
{
    extractionMethod    extractFromSurface;
    extractFromSurfaceCoeffs
    {
         includedAngle   120;
    }
    writeObj                no;
}

// ************************************************************************* //
